---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.TooSmallVertexSegementDistInFinalLoop
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.TooSmallVertexSegementDistInFinalLoop

A face loop with too small vertex-segment distance.
 Associated numbers are face, loop, segment and vertex
 indices respectively